
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// {{ Михайлов К.В. homework-13-7     
	
	МодульРасширения1ВызовСервера.ДобавитьГруппуСкидкаВГруппаШапкаЛево(ЭтотОбъект);
	МодульРасширения1ВызовСервера.ДобавитьСогласованнаяСкидкаВГруппаШапкаЛево(ЭтотОбъект);
	МодульРасширения1ВызовСервера.ДобавитьКнопкуПересчитатьДокумент(ЭтотОбъект); 
		
	// }}
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииСкидки(Элемент) 
	// {{ Михайлов К.В. homework-13-7 
	
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		ПересчитатьСоСкидкойАсинх();
	КонецЕсли;
	
	// }}
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПересчитатьСоСкидкойАсинх()
	// {{ Михайлов К.В. homework-13-7
	
	Результат = Ждать ВопросАсинх("Скидка изменилась. Пересчитать документ?", РежимДиалогаВопрос.ДаНет);
	
	Если Результат = КодВозвратаДиалога.Да Тогда	
		ПересчитатьВсеТаблицы();
	КонецЕсли;
	
	// }}
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьДокумент(Команда) 
	// {{ Михайлов К.В. homework-13-7 
	
	ПересчитатьВсеТаблицы();
	
	// }}
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьВсеТаблицы() 
	// {{ Михайлов К.В. homework-13-7
		
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(ТекущаяСтрока);
	КонецЦикла; 
	
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(ТекущаяСтрока);
	КонецЦикла; 
	
	// }}
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	// {{ Михайлов К.В. homework-13-7 
	
	// Исходный код:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	// Новый код
	ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.Расш1_СогласованнаяСкидка;
	Если ОбщаяСкидка > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Суммарная скидка по номенклатуре %1 превышает %2, значение скорректировано", ТекущиеДанные.Номенклатура, "100%");
		Сообщение.Сообщить();
		ТекущиеДанные.Скидка = 100 - Объект.Расш1_СогласованнаяСкидка;
		ОбщаяСкидка = 100;
	КонецЕсли;		
	КоэффициентСкидки = 1 - ОбщаяСкидка / 100;
	
	// }}
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	// {{ Михайлов К.В. homework-13-7 
	РассчитатьСуммуДокумента();
	// }} 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
