   
// {{ Михайлов К.В. homework-13-7

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма);
	КонецЕсли;
		
КонецПроцедуры    

Процедура ДобавитьГруппуСкидкаВГруппаШапкаЛево(Форма) Экспорт   
	
	Группа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево); 
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	
КонецПроцедуры

Процедура ДобавитьСогласованнаяСкидкаВГруппаШапкаЛево(Форма) Экспорт 
		
	ПолеВвода = Форма.Элементы.Добавить("Расш1_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево.ПодчиненныеЭлементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСкидки");
		
КонецПроцедуры

Процедура ДобавитьКнопкуПересчитатьДокумент(Форма) Экспорт 

	Команда = Форма.Команды.Добавить("ПересчитатьДокумент");
	Команда.Заголовок = "Пересчитать документ";
	Команда.Действие = "КомандаПересчитатьДокумент";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьДокумент", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево.ПодчиненныеЭлементы.ГруппаСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьДокумент";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма) 
		
	ПолеВвода = Форма.Элементы.Добавить("Расш1_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо";
		
КонецПроцедуры


Процедура ДобавитьКонтактноеЛицоПередСуммаДокумента(Форма) 
		
	ПолеВвода = Форма.Элементы.Вставить("Расш1_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо";
		
КонецПроцедуры      

#КонецОбласти  
// }}
